const base64 = [
	'A','B','C','D','E','F','G','H','I','J','K','L','M',
	'N','O','P','Q','R','S','T','U','V','W','X','Y','Z',
	'a','b','c','d','e','f','g','h','i','j','k','l','m',
	'n','o','p','q','r','s','t','u','v','w','x','y','z',
	'0','1','2','3','4','5','6','7','8','9','+','/','='
]

const subject64 = [
	'峰哥','龙神','谢彬','09','p神','乌总','宝哥','罗王','慕斯','b神','马甲','霉皇','塞拉',
	'猪皇','神仆','下面','老陈','海涛','国土','单车','伦伦','小刘','鲷哥','小明','老怼','核桃',
	'dc','大狗','大木','陈雅','剑来','卡卡','生辰','冷锋','永仁','fy','阿么','苏畅','皮鞋',
	'牧师','三冰','芬队','莫奈','乍得','二冰','教练','歪西','盖狗','大球','霸气','林神','罗导',
	'鸭神','冷冷','op','崩7','兆兆','饭皇','峯䔅','曹操','枫哥','姜岑','沪皇','吃人','峯哥'
]

const verb64 = [
	'拯救','拉了','喜欢','转化','飞往','爱上','过了','送了','带走','奔向','进了','就是','踢了',
	'爱吃','保护','仰慕','追求','羡慕','超越','来自','像个','总是','变成','没了','天生','爱好',
	'又名','抽了','成了','成就','嫉妒','讨厌','属于','黑了','嘲讽','欢送','冒充','遇上','调侃',
	'下了','爱玩','赚了','爱看','也是','抱了','绿了','学了','包揽','没有','输给','吃了','替代',
	'是个','冲进','打了','创造','拿了','吸了','主宰','玩了','称霸','收了','戴了','买了','哈喽'
]

const object64 = [
	'刀塔','黄翔','发发','猪肉','海南','峰哥','蛋糕','外卖','天赋','云南','TI','泰迪','阿鲷',
	'泔水','严峻','09','单车','谢彬','b神','韩国','大妈','备胎','农民','灵气','废物','扫地',
	'肥宅','烟头','帅哥','老怼','阿川','dc','乌总','周雄','甲鱼','萌p','陈雅','冷锋','皮鞋',
	'围棋','先知','奶粉','里番','宅男','大腿','自己','技术','门票','节奏','罗王','外围','神仆',
	'传说','泉水','中单','艺术','冠军','人气','刀圈','扑克','OB','火箭','绿帽','马桶','捞陈'
]


function key2val(key, val) {
	const rt = {};
	for (let i = 0 ; i < key.length ; i++) {
		rt[key[i]] = val[i];
	}
	return rt;
}

export const base2sub = (() => {
	return key2val(base64, subject64);
})();

export const sub2base = (() => {
	return key2val(subject64, base64);
})();

export const base2verb = (() => {
	return key2val(base64, verb64);
})();

export const verb2base = (() => {
	return key2val(verb64, base64);
})();

export const base2obj = (() => {
	return key2val(base64, object64);
})();

export const obj2base = (() => {
	return key2val(object64, base64);
})();

export const verbExt = '哈罗';
export const objExt = '捞趁';
